taboadaa/ShuQi/nRF/Packages/.cache/Keil.Kinetis_KVxx_DFP.1.7.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>Kinetis_KVxx_DFP</name>
  <description>NXP Kinetis KVxx Series Device Support</description>

  <releases>
    <release version="1.7.0" date="2017-05-08">
      Updated device header files: added ARM Clang 6 directives for handling anonymous unions
      Added FAC Flash Algorithm for KV11, KV3xF, KV4xF devices.
      Corrected KV56F, KV58F startup code (Flash configuration address).
      Updated documentation.
      Updated boards description.
      Changed device vendor to NXP
    </release>
    <release version="1.6.0" date="2016-04-04">
      Updated KV56F, KV58F Device Support.
    </release>
    <release version="1.5.0" date="2015-09-30">
      Updated KV4x Device Support
      - KV4x device names updated to reflect new maximum clock frequency of 168 MHz
      Updated TWR-KV46F150M Blinky example.
    </release>
    <release version="1.4.0" date="2015-07-31">
      Updated Device Support now support KV1x, KV3x, KV4x and KV5x subfamilies
      Added TWR-KV11Z75M Blinky example.
      Updated KV11 Flash Algorithms (2KB sector).
    </release>
    <release version="1.3.0" date="2014-10-06">
      Added KV4x sub-family CMSIS Core and CMSIS SVD files.
      SRAM ranges corrected.
    </release>
    <release version="1.2.0" date="2014-06-24">
      Updated KV3x sub-family CMSIS Core and CMSIS SVD files.
    </release>
    <release version="1.1.0" date="2014-06-12">
      Added KV3x sub-family devices.
      Added TWR-KV10Z32 board description.
    </release>
   <release version="1.0.0">
      First Release version of KVxx Device Family Pack.
    </release>
  </releases>

  <keywords>
  <!-- keywords for indexing -->
    <keyword>NXP</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package NXP</keyword>
    <keyword>KVxx</keyword>
  </keywords>

  <devices>
    <family Dfamily="KVxx Series" Dvendor="NXP:11">
      <description>
Kinetis V Series MCUs are based upon the ARM® Cortex®-M0+, Cortex-M4 and Cortex-M7 cores and are designed for a wide range of BLDC, PMSM and ACIM motor control and digital power conversion applications.
      </description>

      <!-- ******************************  KV1x  ****************************** -->
      <subFamily DsubFamily="KV1x">
        <processor Dcore="Cortex-M0+" DcoreVersion="r0p0"/>
        <book name="Documents/dui0662a_cortex_m0p_r0p0_dgug.pdf" title="Cortex-M0+ Generic User Guide"/>
        <description>
The Kinetis KV1x MCU family is the entry point of the V series. Built upon the ARM® Cortex®-M0+ core running at 75 MHz with hardware square root and divide capability, it delivers a 27% increase in performance in math-intensive applications versus comparable MCUs, allowing it to target BLDC as well as more computationally demanding PMSM motors.
Additional features include integrated FlexCAN, dual 16-bit analog-to-digital controllers (ADCs) sampling at up to 1.2 mega samples per second (MS/s) in 12-bit mode, multiple motor control timers, up to 128 KB of flash memory and a comprehensive enablement suite from NXP and third-party resources, including reference designs, software libraries and motor configuration tools.
        </description>

        <!-- ******************************  MKV10Z16xxx7  ****************************** -->
        <device Dname="MKV10Z16xxx7">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="75000000"/>
          <compile header="Device/Include/MKV10Z7.h" define="MKV10Z16xxx7"/>
          <debug svd="SVD/MKV10Z7.svd"/>
          <memory id="IROM1"                          start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                          start="0x1FFFF800" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/MKV_P16_1KB_SEC.FLM" start="0x00000000" size="0x00004000" RAMstart="0x20000000" RAMsize="0x0800" default="1"/>

          <book name="Documents/KV10P48M75RM.pdf" title="MKV10Z16xxx7 Reference Manual"/>
          <book name="Documents/KV10P48M75.pdf"   title="MKV10Z16xxx7 Data Sheet"/>
        </device>

        <!-- ******************************  MKV10Z32xxx7  ****************************** -->
        <device Dname="MKV10Z32xxx7">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="75000000"/>
          <compile header="Device/Include/MKV10Z7.h" define="MKV10Z32xxx7"/>
          <debug svd="SVD/MKV10Z7.svd"/>
          <memory id="IROM1"                          start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                          start="0x1FFFF800" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/MKV_P32_1KB_SEC.FLM" start="0x00000000" size="0x00008000" RAMstart="0x20000000" RAMsize="0x0800" default="1"/>

          <book name="Documents/KV10P48M75RM.pdf" title="MKV10Z32xxx7 Reference Manual"/>
          <book name="Documents/KV10P48M75.pdf"   title="MKV10Z32xxx7 Data Sheet"/>
        </device>

        <!-- ******************************  MKV10Z64xxx7  ****************************** -->
        <device Dname="MKV10Z64xxx7">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="75000000"/>
          <compile header="Device/Include/MKV10Z1287.h" define="MKV10Z64xxx7"/>
          <debug svd="SVD/MKV10Z1287.svd"/>
          <memory id="IROM1"                          start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                          start="0x1FFFF000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/MKV_P64_2KB_SEC.FLM" start="0x00000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>

          <book name="Documents/KV11P64M75RM.pdf" title="MKV10Z64xxx7 Reference Manual"/>
          <book name="Documents/KV11P64M75.pdf"   title="MKV10Z64xxx7 Data Sheet"/>
        </device>

