taboadaa/ShuQi/nRF/Packages/.cache/Keil.Kinetis_KVxx_DFP.1.7.0.pdsc
        <!-- ******************************  MKV10Z128xxx7  ****************************** -->
        <device Dname="MKV10Z128xxx7">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="75000000"/>
          <compile header="Device/Include/MKV10Z1287.h" define="MKV10Z128xxx7"/>
          <debug svd="SVD/MKV10Z1287.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x1FFFF000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/MKV_P128_2KB_SEC.FLM" start="0x00000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>

          <book name="Documents/KV11P64M75RM.pdf" title="MKV10Z128xxx7 Reference Manual"/>
          <book name="Documents/KV11P64M75.pdf"   title="MKV10Z128xxx7 Data Sheet"/>
        </device>

        <!-- ******************************  MKV11Z64xxx7  ****************************** -->
        <device Dname="MKV11Z64xxx7">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="75000000"/>
          <compile header="Device/Include/MKV11Z7.h" define="MKV11Z64xxx7"/>
          <debug svd="SVD/MKV11Z7.svd"/>
          <memory id="IROM1"                          start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                          start="0x1FFFF000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/MKV_P64_2KB_SEC.FLM" start="0x00000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>
          <algorithm name="Flash/MKV1x_FAC.FLM"       start="0xFFFF0000" size="0x00000024" RAMstart="0x20000000" RAMsize="0x1000" default="0"/>

          <book name="Documents/KV11P64M75RM.pdf" title="MKV11Z64xxx7 Reference Manual"/>
          <book name="Documents/KV11P64M75.pdf"   title="MKV11Z64xxx7 Data Sheet"/>
        </device>

        <!-- ******************************  MKV11Z128xxx7  ****************************** -->
        <device Dname="MKV11Z128xxx7">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="75000000"/>
          <compile header="Device/Include/MKV11Z7.h" define="MKV11Z128xxx7"/>
          <debug svd="SVD/MKV11Z7.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x1FFFF000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/MKV_P128_2KB_SEC.FLM" start="0x00000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>
          <algorithm name="Flash/MKV1x_FAC.FLM"        start="0xFFFF0000" size="0x00000024" RAMstart="0x20000000" RAMsize="0x1000" default="0"/>

          <book name="Documents/KV11P64M75RM.pdf" title="MKV11Z128xxx7 Reference Manual"/>
          <book name="Documents/KV11P64M75.pdf"   title="MKV11Z128xxx7 Data Sheet"/>
        </device>
      </subFamily>

      <!-- ******************************  KV3x  ****************************** -->
      <subFamily DsubFamily="KV3x">
        <processor Dcore="Cortex-M4" DcoreVersion="r0p1"/>
        <book name="Documents/dui0553a_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>
        <description>
The Kinetis KV3x family of MCUs delivers a high-performance solution for BLDC, PMSM and ACIM motor control applications.
Built upon the ARM Cortex-M4 core running at 100 or 120 MHz with DSP instruction set and floating point unit, the KV3 devices feature dual 16-bit analog-to-digital converters (ADCs) sampling at up to 1.2 mega samples per second (MSPS) in 12-bit mode, multiple motor control timers, 64 to 512 KB of flash memory and a comprehensive enablement suite from proprietary and third-party resources, including reference designs for ACIM, BLDC and PMSM motor control built on NXP's Embedded Software libraries and motor configuration tools.
        </description>

        <!-- ******************************  MKV30F64xxx10   ******************** -->
        <device Dname="MKV30F64xxx10">
          <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="100000000"/>
          <compile header="Device/Include/MKV30F12810.h" define="MKV30F64xxx10"/>
          <debug svd="SVD/MKV30F12810.svd"/>
          <memory id="IROM1"                 start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                 start="0x1FFFE000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P64.FLM" start="0x00000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>
          <algorithm name="Flash/MKV3x_FAC.FLM" start="0xFFFF0000" size="0x00000024" RAMstart="0x20000000" RAMsize="0x1000" default="0"/>

          <book name="Documents/KV30P64M100SFARM.pdf" title="MKV30F64xxx10 Reference Manual"/>
          <book name="Documents/KV30P64M100SFA.pdf"   title="MKV30F64xxx10 Data Sheet"/>
        </device>

        <!-- ******************************  MKV30F128xxx10  ******************** -->
        <device Dname="MKV30F128xxx10">
          <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="100000000"/>
          <compile header="Device/Include/MKV30F12810.h" define="MKV30F128xxx10"/>
          <debug svd="SVD/MKV30F12810.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x1FFFE000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P128.FLM" start="0x00000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>
          <algorithm name="Flash/MKV3x_FAC.FLM" start="0xFFFF0000" size="0x00000024" RAMstart="0x20000000" RAMsize="0x1000" default="0"/>

          <book name="Documents/KV30P64M100SFARM.pdf" title="MKV30F128xxx10 Reference Manual"/>
          <book name="Documents/KV30P64M100SFA.pdf"   title="MKV30F128xxx10 Data Sheet"/>
        </device>

