taboadaa/ShuQi/nRF/Packages/.cache/Keil.Kinetis_KVxx_DFP.1.7.0.pdsc
        <!-- ******************************  MKV31F128xxx10 ********************* -->
        <device Dname="MKV31F128xxx10">
          <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="100000000"/>
          <compile header="Device/Include/MKV31F12810.h" define="MKV31F128xxx10"/>
          <debug svd="SVD/MKV31F12810.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x1FFFE000" size="0x00006000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P128.FLM" start="0x00000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>
          <algorithm name="Flash/MKV3x_FAC.FLM" start="0xFFFF0000" size="0x00000024" RAMstart="0x20000000" RAMsize="0x1000" default="0"/>

          <book name="Documents/KV31P100M100SF9RM.pdf" title="MKV31F128xxx10 Reference Manual"/>
          <book name="Documents/KV31P100M100SF9.pdf"   title="MKV31F128xxx10 Data Sheet"/>
        </device>

        <!-- ******************************  MKV31F256xxx12 ********************* -->
        <device Dname="MKV31F256xxx12">
          <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
          <compile header="Device/Include/MKV31F25612.h" define="MKV31F256xxx12"/>
          <debug svd="SVD/MKV31F25612.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x1FFFC000" size="0x0000C000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P256.FLM" start="0x00000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>
          <algorithm name="Flash/MKV3x_FAC.FLM" start="0xFFFF0000" size="0x00000024" RAMstart="0x20000000" RAMsize="0x1000" default="0"/>

          <book name="Documents/KV31P100M120SF8RM.pdf" title="MKV31F256xxx12 Reference Manual"/>
          <book name="Documents/KV31P100M120SF8.pdf"   title="MKV31F256xxx12 Data Sheet"/>
        </device>

        <!-- ******************************  MKV31F512xxx12 ********************* -->
        <device Dname="MKV31F512xxx12">
          <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
          <compile header="Device/Include/MKV31F51212.h" define="MKV31F512xxx12"/>
          <debug svd="SVD/MKV31F51212.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x1FFF8000" size="0x00018000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P512.FLM" start="0x00000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>
          <algorithm name="Flash/MKV3x_FAC.FLM" start="0xFFFF0000" size="0x00000024" RAMstart="0x20000000" RAMsize="0x1000" default="0"/>

          <book name="Documents/KV31P100M120SF7RM.pdf" title="MKV31F512xxx12 Reference Manual"/>
          <book name="Documents/KV31P100M120SF7.pdf"   title="MKV31F512xxx12 Data Sheet"/>
        </device>
      </subFamily>

      <!-- ******************************  KV4x  ****************************** -->
      <subFamily DsubFamily="KV4x">
        <processor Dcore="Cortex-M4" DcoreVersion="r0p1"/>
        <book name="Documents/dui0553a_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>
        <description>
The Kinetis KV4x family of MCUs is a high-performance solution offering exceptional precision, sensing and control for some of the most demanding applications in motor and power control.
Built upon the ARM® Cortex®-M4 core running at 168 MHz with DSP and floating point unit, it features advanced high-speed and high-accuracy peripherals such as high-resolution pulse-width modulation (PWM) with 312 picosecond resolution, dual 12-bit analog-to-digital converters (ADCs) sampling at 4.1 mega samples per second (MSPS), a total of 30 PWM channels for support of multi-motor systems and dual FlexCAN modules.
To maximize execution performance a 128-bit wide flash interface is utilized, providing best in class execution from the embedded flash memory. The Kinetis KV4x MCU family is supported by a comprehensive enablement suite from NXP and third-party resources including reference designs, software libraries and motor configuration tools.
        </description>

        <!-- ******************************  MKV42F64xxx16  ******************** -->
        <device Dname="MKV42F64xxx16">
          <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="168000000"/>
          <compile header="Device/Include/MKV42F16.h" define="MKV42F64xxx16"/>
          <debug svd="SVD/MKV42F16.svd"/>
          <memory id="IROM1"                            start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                            start="0x1FFFE000" size="0x00004000" default="1" init   ="0"/>
          <algorithm name="Flash/MKP64_4KB_SECTOR.FLM"  start="0x00000000" size="0x00010000" default="1" RAMstart="0x20000000" RAMsize="0x1000"/>
          <algorithm name="Flash/MKV4x_FAC.FLM"         start="0xFFFF0000" size="0x00000024" default="0" RAMstart="0x20000000" RAMsize="0x1000"/>

          <book name="Documents/KV4XP100M168RM.pdf" title="KV4x Sub-Family Reference Manual"/>
          <book name="Documents/KV4XP100M168.pdf"   title="KV4x Data Sheet"/>
        </device>

        <!-- ******************************  MKV42F128xxx16  ******************** -->
        <device Dname="MKV42F128xxx16">
          <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="168000000"/>
          <compile header="Device/Include/MKV42F16.h" define="MKV42F128xxx16"/>
          <debug svd="SVD/MKV42F16.svd"/>
          <memory id="IROM1"                            start="0x00000000" size="0x00020000" default="1" startup="1"/>
          <memory id="IRAM1"                            start="0x1FFFE000" size="0x00006000" default="1" init   ="0"/>
          <algorithm name="Flash/MKP128_4KB_SECTOR.FLM" start="0x00000000" size="0x00020000" default="1" RAMstart="0x20000000" RAMsize="0x1000"/>
          <algorithm name="Flash/MKV4x_FAC.FLM"         start="0xFFFF0000" size="0x00000024" default="0" RAMstart="0x20000000" RAMsize="0x1000"/>

          <book name="Documents/KV4XP100M168RM.pdf" title="KV4x Sub-Family Reference Manual"/>
          <book name="Documents/KV4XP100M168.pdf"   title="KV4x Data Sheet"/>
        </device>

