taboadaa/ShuQi/nRF/Packages/.cache/Keil.Kinetis_KVxx_DFP.1.7.0.pdsc
        <!-- ******************************  MKV42F256xxx16  ******************** -->
        <device Dname="MKV42F256xxx16">
          <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="168000000"/>
          <compile header="Device/Include/MKV42F16.h" define="MKV42F256xxx16"/>
          <debug svd="SVD/MKV42F16.svd"/>
          <memory id="IROM1"                            start="0x00000000" size="0x00040000" default="1" startup="1"/>
          <memory id="IRAM1"                            start="0x1FFFC000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/MKP256_4KB_SECTOR.FLM" start="0x00000000" size="0x00040000" default="1" RAMstart="0x20000000" RAMsize="0x1000"/>
          <algorithm name="Flash/MKV4x_FAC.FLM"         start="0xFFFF0000" size="0x00000024" default="0" RAMstart="0x20000000" RAMsize="0x1000"/>

          <book name="Documents/KV4XP100M168RM.pdf" title="KV4x Sub-Family Reference Manual"/>
          <book name="Documents/KV4XP100M168.pdf"   title="KV4x Data Sheet"/>
        </device>

        <!-- ******************************  MKV44F64xxx16  ******************** -->
        <device Dname="MKV44F64xxx16">
          <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="168000000"/>
          <compile header="Device/Include/MKV44F16.h" define="MKV44F64xxx16"/>
          <debug svd="SVD/MKV44F16.svd"/>
          <memory id="IROM1"                            start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                            start="0x1FFFE000" size="0x00004000" default="1" init   ="0"/>
          <algorithm name="Flash/MKP64_4KB_SECTOR.FLM"  start="0x00000000" size="0x00010000" default="1" RAMstart="0x20000000" RAMsize="0x1000"/>
          <algorithm name="Flash/MKV4x_FAC.FLM"         start="0xFFFF0000" size="0x00000024" default="0" RAMstart="0x20000000" RAMsize="0x1000"/>

          <book name="Documents/KV4XP100M168RM.pdf" title="KV4x Sub-Family Reference Manual"/>
          <book name="Documents/KV4XP100M168.pdf"   title="KV4x Data Sheet"/>
        </device>

        <!-- ******************************  MKV44F128xxx16  ******************** -->
        <device Dname="MKV44F128xxx16">
          <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="168000000"/>
          <compile header="Device/Include/MKV44F16.h" define="MKV44F128xxx16"/>
          <debug svd="SVD/MKV44F16.svd"/>
          <memory id="IROM1"                             start="0x00000000" size="0x00020000" default="1" startup="1"/>
          <memory id="IRAM1"                             start="0x1FFFE000" size="0x00006000" default="1" init   ="0"/>
          <algorithm  name="Flash/MKP128_4KB_SECTOR.FLM" start="0x00000000" size="0x00020000" default="1" RAMstart="0x20000000" RAMsize="0x1000"/>
          <algorithm name="Flash/MKV4x_FAC.FLM"          start="0xFFFF0000" size="0x00000024" default="0" RAMstart="0x20000000" RAMsize="0x1000"/>

          <book name="Documents/KV4XP100M168RM.pdf" title="KV4x Sub-Family Reference Manual"/>
          <book name="Documents/KV4XP100M168.pdf"   title="KV4x Data Sheet"/>
        </device>

        <!-- ******************************  MKV44F256xxx16  ******************** -->
        <device Dname="MKV44F256xxx16">
          <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="168000000"/>
          <compile header="Device/Include/MKV44F16.h" define="MKV44F256xxx16"/>
          <debug svd="SVD/MKV44F16.svd"/>
          <memory id="IROM1"                            start="0x00000000" size="0x00040000" default="1" startup="1"/>
          <memory id="IRAM1"                            start="0x1FFFC000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/MKP256_4KB_SECTOR.FLM" start="0x00000000" size="0x00040000" default="1" RAMstart="0x20000000" RAMsize="0x1000"/>
          <algorithm name="Flash/MKV4x_FAC.FLM"         start="0xFFFF0000" size="0x00000024" default="0" RAMstart="0x20000000" RAMsize="0x1000"/>

          <book name="Documents/KV4XP100M168RM.pdf" title="KV4x Sub-Family Reference Manual"/>
          <book name="Documents/KV4XP100M168.pdf"   title="KV4x Data Sheet"/>
        </device>

        <!-- ******************************  MKV46F128xxx16  ******************** -->
        <device Dname="MKV46F128xxx16">
          <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="168000000"/>
          <compile header="Device/Include/MKV46F16.h" define="MKV46F128xxx16"/>
          <debug svd="SVD/MKV46F16.svd"/>
          <memory id="IROM1"                            start="0x00000000" size="0x00020000" default="1" startup="1"/>
          <memory id="IRAM1"                            start="0x1FFFE000" size="0x00006000" default="1" init   ="0"/>
          <algorithm name="Flash/MKP128_4KB_SECTOR.FLM" start="0x00000000" size="0x00020000" default="1" RAMstart="0x20000000" RAMsize="0x1000"/>
          <algorithm name="Flash/MKV4x_FAC.FLM"         start="0xFFFF0000" size="0x00000024" default="0" RAMstart="0x20000000" RAMsize="0x1000"/>

          <book name="Documents/KV4XP100M168RM.pdf" title="KV4x Sub-Family Reference Manual"/>
          <book name="Documents/KV4XP100M168.pdf"   title="KV4x Data Sheet"/>
        </device>

        <!-- ******************************  MKV46F256xxx16  ******************** -->
        <device Dname="MKV46F256xxx16">
          <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="168000000"/>
          <compile header="Device/Include/MKV46F16.h" define="MKV46F256xxx16"/>
          <debug svd="SVD/MKV46F16.svd"/>
          <memory id="IROM1"                            start="0x00000000" size="0x00040000" default="1" startup="1"/>
          <memory id="IRAM1"                            start="0x1FFFC000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/MKP256_4KB_SECTOR.FLM" start="0x00000000" size="0x00040000" default="1" RAMstart="0x20000000" RAMsize="0x1000"/>
          <algorithm name="Flash/MKV4x_FAC.FLM"         start="0xFFFF0000" size="0x00000024" default="0" RAMstart="0x20000000" RAMsize="0x1000"/>

          <book name="Documents/KV4XP100M168RM.pdf" title="KV4x Sub-Family Reference Manual"/>
          <book name="Documents/KV4XP100M168.pdf"   title="KV4x Data Sheet"/>
        </device>
      </subFamily>

      <!-- ******************************  KV5x  ****************************** -->
      <subFamily DsubFamily="KV5x">
        <processor Dcore="Cortex-M7" DcoreVersion="r0p0"/>
        <book name="Documents/DUI0646A_cortex_m7_dgug.pdf" title="Cortex-M7 Generic User Guide"/>
        <description>
The Kinetis KV5x family of MCU is a high-performance solution offering exceptional precision, sensing and control targeting industrial motor control, industrial drives and automation and power conversion applications.
The Kinetis KV5x MCU is built on the ARM® Cortex®-M7 core running at 220 MHz with single precision floating point unit. It features high-resolution pulse-width modulation (PWM) with 284 picosecond resolution, 4x 12-bit analog-to-digital converters (ADCs) sampling at 5 mega samples per second (MS/s), 3 FlexCAN modules, optional Ethernet communications and comprehensive enablement suite from NXP and third-party resources including reference designs, software libraries and motor configuration tools.
        </description>

        <!-- ******************************  MKV56F512xxx24  ******************** -->
        <device Dname="MKV56F512xxx24">
          <processor Dfpu="SP_FPU" Dmpu="0" Dendian="Little-endian" Dclock="240000000"/>
          <compile header="Device/Include/MKV56F24.h" define="MKV56F512xxx24"/>
          <debug svd="SVD/MKV56F24.svd"/>
          <memory id="IROM1"                            start="0x10000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                            start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash/MKV_P512_8KB_SEC.FLM"  start="0x10000000" size="0x00080000"             default="1"/>

          <book name="Documents/KV5XP144M220RM.pdf" title="KV5x Sub-Family Reference Manual"/>
          <book name="Documents/KV5XP144M220.pdf"   title="KV5x Data Sheet"/>
        </device>

