taboadaa/ShuQi/nRF/Packages/.cache/Keil.Kinetis_KVxx_DFP.1.7.0.pdsc
  </conditions>

  <components>
    <!-- Startup KV10Z7 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="KV10Z7 CMSIS">
      <description>System Startup for Kinetis KV10 75MHz devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKV10Z7.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKV10Z7.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKV10Z1287 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKV10Z1287 CMSIS">
      <description>System Startup for Kinetis KV10 64/128 KB 75MHz devices devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKV10Z1287.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKV10Z1287.c"      attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_MKV10Z1287.h"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKV11Z7 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKV11Z7 CMSIS">
      <description>System Startup for Kinetis KV11 75MHz devices devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKV11Z7.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKV11Z7.c"      attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_MKV11Z7.h"      attr="config" version="1.0.0"/>

        <!-- Flash Access Control Bytes templat -->
        <file category="source" name="Device/Source/ARM/MKV1x_FAC.s"        attr="template"               condition="Compiler ARMCC" select="Flash Execute-Only Access Control Template"/>
      </files>
    </component>

    <!-- Startup KV30F10 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="KV30F10 CMSIS">
      <description>System Startup for Kinetis KV30 100MHz devices devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKV30F12810.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKV30F12810.c"      attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_MKV30F12810.h"      attr="config" version="1.0.0"/>

        <!-- Flash Access Control Bytes templat -->
        <file category="source" name="Device/Source/ARM/MKV3x_FAC.s"            attr="template"               condition="Compiler ARMCC" select="Flash Execute-Only Access Control Template"/>
      </files>
    </component>

    <!-- Startup KV31F10 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="KV31F10 CMSIS">
      <description>System Startup for Kinetis KV31 100MHz devices devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKV31F12810.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKV31F12810.c"      attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_MKV31F12810.h"      attr="config" version="1.0.0"/>

        <!-- Flash Access Control Bytes templat -->
        <file category="source" name="Device/Source/ARM/MKV3x_FAC.s"            attr="template"               condition="Compiler ARMCC" select="Flash Execute-Only Access Control Template"/>
      </files>
    </component>

    <!-- Startup KV31F25612 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="KV31F25612 CMSIS">
      <description>System Startup for Kinetis KV31 256 KB 120MHz devices devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKV31F25612.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKV31F25612.c"      attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_MKV31F25612.h"      attr="config" version="1.0.0"/>

        <!-- Flash Access Control Bytes templat -->
        <file category="source" name="Device/Source/ARM/MKV3x_FAC.s"            attr="template"               condition="Compiler ARMCC" select="Flash Execute-Only Access Control Template"/>
      </files>
    </component>

    <!-- Startup KV31F51212 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="KV31F51212 CMSIS">
      <description>System Startup for Kinetis KV31 512 KB 120MHz devices devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKV31F51212.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKV31F51212.c"      attr="config" version="1.0.0"/>

        <!-- Flash Access Control Bytes templat -->
        <file category="source" name="Device/Source/ARM/MKV3x_FAC.s"            attr="template"               condition="Compiler ARMCC" select="Flash Execute-Only Access Control Template"/>
      </files>
    </component>

    <!-- Startup KV42F16 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="KV42F16 CMSIS">
      <description>System Startup for Kinetis KV42 168MHz devices devices devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKV42F16.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKV42F16.c"      attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_MKV42F16.h"      attr="config" version="1.0.0"/>

        <!-- Flash Access Control Bytes templat -->
        <file category="source" name="Device/Source/ARM/MKV4x_FAC.s"         attr="template"               condition="Compiler ARMCC" select="Flash Execute-Only Access Control Template"/>
      </files>
    </component>

    <!-- Startup KV44F16 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="KV44F16 CMSIS">
      <description>System Startup for Kinetis KV44 168MHz devices devices devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKV44F16.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKV44F16.c"      attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_MKV44F16.h"      attr="config" version="1.0.0"/>

        <!-- Flash Access Control Bytes templat -->
        <file category="source" name="Device/Source/ARM/MKV4x_FAC.s"         attr="template"               condition="Compiler ARMCC" select="Flash Execute-Only Access Control Template"/>
      </files>
    </component>

