taboadaa/ShuQi/nRF/Packages/.cache/Keil.Kinetis_KVxx_DFP.1.7.0.pdsc
    <!-- Startup KV46F16 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="KV46F16 CMSIS">
      <description>System Startup for Kinetis KV46 168MHz devices devices devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKV46F16.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKV46F16.c"      attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_MKV46F16.h"      attr="config" version="1.0.0"/>

        <!-- Flash Access Control Bytes templat -->
        <file category="source" name="Device/Source/ARM/MKV4x_FAC.s"         attr="template"               condition="Compiler ARMCC" select="Flash Execute-Only Access Control Template"/>
      </files>
    </component>

    <!-- Startup KV56F22 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="KV56F22 CMSIS">
      <description>System Startup for Kinetis KV56 220MHz devices devices devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKV56F24.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKV56F24.c"      attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_MKV56F24.h"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup KV58F22 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="KV58F22 CMSIS">
      <description>System Startup for Kinetis KV58 220MHz devices devices devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKV58F24.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKV58F24.c"      attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_MKV58F24.h"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <bundle Cbundle="TWR-KV11Z75M" Cclass="Board Support" Cversion="1.0.0">
      <description>TWR-KV11Z75M Board Support</description>
      <doc></doc>
      <component Cgroup="Buttons" Capiversion="1.00" condition="MKV11Z7 CMSIS">
      <description>Button driver for NXP TWR-KV11Z75M board</description>
        <files>
          <file category="source" name="Boards/NXP/TWR-KV11Z75M/Common/Buttons_TWR-KV11Z75M.c"/>
        </files>
      </component>
      <component Cgroup="LED" Capiversion="1.00" condition="MKV11Z7 CMSIS">
      <description>LED driver for NXP TWR-KV11Z75M board</description>
        <files>
          <file category="source" name="Boards/NXP/TWR-KV11Z75M/Common/LED_TWR-KV11Z75M.c"/>
        </files>
      </component>
    </bundle>

    <bundle Cbundle="TWR-KV46F150M" Cclass="Board Support" Cversion="1.0.0">
      <description>TWR-KV46F150M Board Support</description>
      <doc></doc>
      <component Cgroup="Buttons" Capiversion="1.00" condition="KV46F16 CMSIS">
      <description>Button driver for NXP TWR-KV46F150M board</description>
        <files>
          <file category="source" name="Boards/NXP/TWR-KV46F150M/Common/Buttons_TWR-KV46F150M.c"/>
        </files>
      </component>
      <component Cgroup="LED" Capiversion="1.00" condition="KV46F16 CMSIS">
      <description>LED driver for NXP TWR-KV11Z75M board</description>
        <files>
          <file category="source" name="Boards/NXP/TWR-KV46F150M/Common/LED_TWR-KV46F150M.c"/>
        </files>
      </component>
    </bundle>
  </components>

  <boards>
    <board name="TWR-KV10Z32" vendor="NXP" revision="Rev. A" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="MKV10Z32xxx7"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" DsubFamily="KV10"/>
      <description>The TWR-KV10Z32 is a development tool for the Kinetis V series KV1x family built on the ARM® Cortex™-M0+ processor.</description>
      <image small="Boards/NXP/TWR-KV10Z32/Documents/TWR-KV10Z32_small.jpg"/>
      <book category="overview"  name="http://www.nxp.com/products/microcontrollers-and-processors/arm-processors/kinetis-cortex-m-mcus/kinetis-symbols-footprints-and-models/kinetis-kv1x-family-tower-system-module:TWR-KV10Z32" title="TWR-KV10Z32 Web Page"/>
      <book category="setup"     name="Boards/NXP/TWR-KV10Z32/Documents/MKV10Z32QSG.pdf"     title="Quick Start Guide"/>
      <book category="schematic" name="Boards/NXP/TWR-KV10Z32/Documents/TWR-KV10Z32_SCH.pdf" title="Schematics"/>
      <book category="manual"    name="Boards/NXP/TWR-KV10Z32/Documents/TWRKV10Z32UG.pdf"    title="User Manual"/>
      <feature type="ODbg"      n="1"              name="Integrated open-source JTAG via USB"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="ConnOther" n="2"              name="Motor Control Auxiliary Connector"/>
      <feature type="ConnOther" n="2"              name="Tower connectivity for access to USB, Ethernet, RS232/RS485, CAN, SPI, I²C, Flexbus, etc."/>
      <feature type="Button"    n="2"/>
      <feature type="Accelerometer" n="1"          name="Three axis accelerometer (MMA78451Q)"/>
      <feature type="LED"       n="8"              name="Eight user-controlled LEDs with connected buffers to PWM channels for dimming"/>
      <debugInterface adapter="JTAG/SW"   connector="10 pin Cortex debug (0.05 inch connector)"/>
      <debugInterface adapter="CMSIS-DAP" connector="USB Mini-B"/>
      <feature type="TowerFF"   n="1"/>
    </board>

    <board name="TWR-KV11Z75M" vendor="NXP" revision="Rev. A" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <description>TWR-KV11Z75M: Kinetis V Series Tower System Module.</description>
      <image small="Boards/NXP/TWR-KV11Z75M/Documents/TWR-KV11Z75M_small.jpg"
             large="Boards/NXP/TWR-KV11Z75M/Documents/TWR-KV11Z75M_large.jpg"/>
      <book category="overview"  name="http://www.nxp.com/products/software-and-tools/hardware-development-tools/tower-development-boards/mcu-and-processor-modules/kinetis-modules/kinetis-kv1x-64-kb-and-128-kb-family-tower-system-module:TWR-KV11Z75M"  title="TWR-KV11Z75M: Kinetis V Series Tower System Module"/>
      <book category="setup"     name="Boards/NXP/TWR-KV11Z75M/Documents/TWRKV11Z75MQSG.pdf"   title="Quick Start Guide"/>
      <book category="schematic" name="Boards/NXP/TWR-KV11Z75M/Documents/TWR-KV11Z75M-SCH.pdf" title="Schematics"/>
      <book category="manual"    name="Boards/NXP/TWR-KV11Z75M/Documents/TWRKV11Z75MUG.pdf"    title="TWR-KV11Z75M Tower Module User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="MKV11Z128xxx7"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" DsubFamily="KV10"/>
      <feature type="ODbg"      n="1"              name="Integrated open-source JTAG via USB"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="ConnOther" n="2"              name="Motor Control Auxiliary Connector"/>
      <feature type="ConnOther" n="2"              name="Tower connectivity for access to USB, Ethernet, RS232/RS485, CAN, SPI, I²C, Flexbus, etc."/>
      <feature type="Button"    n="2"/>
      <feature type="Accelerometer" n="1"          name="Three axis accelerometer (MMA78451Q)"/>
      <feature type="LED"       n="8"              name="Eight user-controlled LEDs with connected buffers to PWM channels for dimming"/>
      <debugInterface adapter="JTAG/SW"   connector="10 pin Cortex debug (0.05 inch connector)"/>
      <debugInterface adapter="CMSIS-DAP" connector="USB Mini-B"/>
      <feature type="TowerFF"   n="1"/>
    </board>

