taboadaa/ShuQi/nRF/Packages/.cache/Keil.Kinetis_KVxx_DFP.1.7.0.pdsc
    <board name="TWR-KV46F150M" vendor="NXP" revision="Rev. A" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <description>The TWR-KV46F150M is a development tool for the 168 MHz KV4x families of Kinetis microcontrollers.</description>
      <image small="Boards/NXP/TWR-KV46F150M/Documents/TWR-KV46F150M_small.jpg"
             large="Boards/NXP/TWR-KV46F150M/Documents/TWR-KV46F150M_large.jpg"/>
      <book category="overview"  name="http://www.nxp.com/products/software-and-tools/hardware-development-tools/tower-development-boards/peripheral-modules/kinetis-kv4x-family-tower-system-module:TWR-KV46F150M"  title="TWR-KV46F150M: Kinetis KV4x Family Tower System Module"/>
      <book category="setup"     name="Boards/NXP/TWR-KV46F150M/Documents/TWR-KV46F150MQSG.pdf" title="TWR-KV46F150M Quick Start Guide for Motor Control"/>
      <book category="schematic" name="Boards/NXP/TWR-KV46F150M/Documents/TWRKV46F150M_SCH.pdf" title="TWR-KV46F150M Schematics"/>
      <book category="manual"    name="Boards/NXP/TWR-KV46F150M/Documents/TWRKV46F150MUG.pdf"   title="TWR-KV46F150M Tower Module User's Guide"/>
      <mountedDevice     deviceIndex="0" Dvendor="NXP:11" Dname="MKV46F256xxx16"/>
      <compatibleDevice  deviceIndex="0" Dvendor="NXP:11" Dfamily="KVxx Series"/>
      <feature type="ODbg"      n="1"              name="OpenSDA debug circuit with Mini USB connector and virtual serial port"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="ConnOther" n="2"              name="Motor Control Auxiliary Connector"/>
      <feature type="ConnOther" n="2"              name="Tower connectivity for access to USB, Ethernet, RS232/RS485, CAN, SPI, I²C, Flexbus, etc."/>
      <feature type="Button"    n="2"/>
      <feature type="LED"       n="9"              name="Eight user-controlled LEDs with connected buffers to PWM channels for dimming"/>
      <feature type="CAN"       n="1"              name="FlexCAN interface"/>
      <feature type="TempSens"  n="4"              name="Thermistors"/>
      <debugInterface adapter="JTAG/SW"   connector="10 pin Cortex debug (0.05 inch connector)"/>
      <debugInterface adapter="CMSIS-DAP" connector="USB Mini-B"/>
      <feature type="TowerFF"   n="1"/>
    </board>
  </boards>

  <examples>
    <!-- TWR-KV10Z32 Development Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards/NXP/TWR-KV10Z32/Blinky">
      <description>Blinky example</description>
      <board name="TWR-KV10Z32" vendor="NXP" Dvendor="NXP:11" Dname="MKV10Z32xxx7"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/NXP/TWR-KV10Z32/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="TWR-KV10Z32" vendor="NXP" Dvendor="NXP:11" Dname="MKV10Z32xxx7"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- TWR-KV11Z75M Tower Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/NXP/TWR-KV11Z75M/Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="TWR-KV11Z75M" vendor="NXP" Dvendor="NXP:11" Dname="MKV11Z128xxx7"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- TWR-KV46F150M Development Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/NXP/TWR-KV46F150M/Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="TWR-KV46F150M" vendor="NXP" Dvendor="NXP:11" Dname="MKV46F256xxx16"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>

</package>
